Revit 2027 API
Application.NewTypeBinding Method
Creates a new empty type binding object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TypeBinding NewTypeBinding()
Public Function NewTypeBinding As TypeBinding
public:
TypeBinding^ NewTypeBinding()
member NewTypeBinding : unit -> TypeBinding
Return Value
TypeBinding
A new type binding object.
Remarks
Type binding objects are used for attaching shared parameter definitions to a type within a category. Categories can be added to the instance binding via the Categories property of the InstanceBinding object
See Also
Reference
Application Class
NewTypeBinding Overload
Autodesk.Revit.Creation Namespace